{"format": "graph-model", "generatedBy": "2.12.1", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"rescaling_15_input": {"name": "rescaling_15_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}, "outputs": {"module_wrapper_175": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "67"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_15/rescaling_15/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/rescaling_15/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_173/flatten_15/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "67"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "67"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rescaling_15_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/rescaling_15/mul", "op": "Mul", "input": ["rescaling_15_input", "StatefulPartitionedCall/sequential_15/rescaling_15/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/rescaling_15/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_15/rescaling_15/mul", "StatefulPartitionedCall/sequential_15/rescaling_15/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_15/rescaling_15/add", "StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_166/max_pooling2d_60/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_166/max_pooling2d_60/MaxPool", "StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_168/max_pooling2d_61/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_168/max_pooling2d_61/MaxPool", "StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_170/max_pooling2d_62/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/Relu"], "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_170/max_pooling2d_62/MaxPool", "StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "filter_format": {"s": "SFdJTw=="}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_172/max_pooling2d_63/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_173/flatten_15/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_172/max_pooling2d_63/MaxPool", "StatefulPartitionedCall/sequential_15/module_wrapper_173/flatten_15/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_173/flatten_15/Reshape", "StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/Relu", "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_15/rescaling_15/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/rescaling_15/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/Conv2D/ReadVariableOp", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_165/conv2d_60/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_167/conv2d_61/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/Conv2D/ReadVariableOp", "shape": [4, 4, 64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_169/conv2d_62/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/Conv2D/ReadVariableOp", "shape": [4, 4, 32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_171/conv2d_63/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_173/flatten_15/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/MatMul/ReadVariableOp", "shape": [144, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_174/dense_30/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/MatMul/ReadVariableOp", "shape": [64, 67], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_15/module_wrapper_175/dense_31/BiasAdd/ReadVariableOp", "shape": [67], "dtype": "float32"}]}]}