{"format": "graph-model", "generatedBy": "2.12.1", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"rescaling_11_input": {"name": "rescaling_11_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}, "outputs": {"module_wrapper_131": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "67"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_11/rescaling_11/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/rescaling_11/Cast_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_129/flatten_11/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "67"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "67"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rescaling_11_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_11/rescaling_11/mul", "op": "Mul", "input": ["rescaling_11_input", "StatefulPartitionedCall/sequential_11/rescaling_11/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/rescaling_11/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_11/rescaling_11/mul", "StatefulPartitionedCall/sequential_11/rescaling_11/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_11/rescaling_11/add", "StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_122/max_pooling2d_44/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_122/max_pooling2d_44/MaxPool", "StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_124/max_pooling2d_45/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_124/max_pooling2d_45/MaxPool", "StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_126/max_pooling2d_46/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_126/max_pooling2d_46/MaxPool", "StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_128/max_pooling2d_47/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_129/flatten_11/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_128/max_pooling2d_47/MaxPool", "StatefulPartitionedCall/sequential_11/module_wrapper_129/flatten_11/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_129/flatten_11/Reshape", "StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/Relu", "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_11/rescaling_11/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/rescaling_11/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/Conv2D/ReadVariableOp", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_121/conv2d_44/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_123/conv2d_45/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/Conv2D/ReadVariableOp", "shape": [4, 4, 64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_125/conv2d_46/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/Conv2D/ReadVariableOp", "shape": [4, 4, 32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_127/conv2d_47/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_129/flatten_11/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/MatMul/ReadVariableOp", "shape": [144, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_130/dense_22/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/MatMul/ReadVariableOp", "shape": [64, 67], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11/module_wrapper_131/dense_23/BiasAdd/ReadVariableOp", "shape": [67], "dtype": "float32"}]}]}